{
  "metadata": {
    "total_samples": 48,
    "source_file": "/home/user/CC/data/scraped_data_output.json",
    "creation_date": "2025-11-13",
    "sampling_strategy": "stratified + edge cases + random",
    "description": "Manually labeled ground truth for validating product type identification"
  },
  "samples": [
    {
      "sample_id": 1,
      "index": 125,
      "title": "3M Organic Vapor Replacement Cartridges (1-Pair) 6001P1-DC",
      "description": "The 3M Organic Vapor Cartridge 6001 provides a quick and easy replacement solution when working with organic vapors encountered when working with latex and oil-based paints, including spray paints, se",
      "brand": "3M",
      "price": 14.98,
      "predicted_cluster": "lighting",
      "true_product_type": "safety_respirator_cartridge",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 2,
      "index": 25,
      "title": "HALO HLBSL4 4 in. Adjustable CCT Canless IC Rated Dimmable Indoor Integrated LED Recessed Light Kit (4-Pack) HLBSL4069FS35-4PK",
      "description": "The Halo HLB4 Selectable 4-Pack is a complete ultra-thin direct mount downlight that offers you the option of choosing your color temperature directly on the fixture. with the flick of a switch, you c",
      "brand": "HALO",
      "price": 58.97,
      "predicted_cluster": "lighting",
      "true_product_type": "recessed_light_fixture",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 3,
      "index": 221,
      "title": "Delta Crestfield 18 in. Towel Bar in Brushed Nickel 138029",
      "description": "The classic design of the Delta Crestfield Bath Collection combines casual elegance with a timeless silhouette. Inspired by the fresh look of American architecture, this set conjures subtle design ele",
      "brand": "Delta",
      "price": 39.19,
      "predicted_cluster": "lighting",
      "true_product_type": "bathroom_towel_bar",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 4,
      "index": 203,
      "title": "Hampton Bay 80 CFM Ceiling Mount Room Side Installation Heavy-Duty Bathroom Exhaust Fan, ENERGY STAR BPT13-14MG",
      "description": "The Hampton Bay heavy duty 80 CFM exhaust fan will reduce moisture in your bathroom to help prevent mildew while running at a quiet 2.0 sones. The exhaust fan is designed to manage moisture in rooms a",
      "brand": "Hampton Bay",
      "price": 59.98,
      "predicted_cluster": "lighting",
      "true_product_type": "bathroom_exhaust_fan",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 5,
      "index": 189,
      "title": "Commercial Electric 36 in. LED White Direct Wire Under Cabinet Light 57005N-WH",
      "description": "Commercial Electric LED Direct Wire Dimmable Under Cabinet Light offers 5 different sizes in 9\", 12\", 18\", 24\", and 36\". We offer this light in a white and bronze finish. This light is designed specif",
      "brand": "Commercial Electric",
      "price": 49.47,
      "predicted_cluster": "lighting",
      "true_product_type": "under_cabinet_light",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 6,
      "index": 142,
      "title": "360 Electrical 24-Watt Revolve 4-Outlet Surge Protector 3E0775-WHT6NA",
      "description": "The Revolve24 employs 24-Watt and 4 USB-A ports to meet all of your charging needs. Add in 4 rotating outlets that fit large plugs and are protected by 1080 joules. All this wrapped in a stylish body ",
      "brand": "360 Electrical",
      "price": 34.99,
      "predicted_cluster": "lighting",
      "true_product_type": "surge_protector_with_usb",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 7,
      "index": 113,
      "title": "HDX 20 in. x 25 in. x 6 in. AprilAire and Space-Gard Replacement Pleated Air Filter (Without Frame) FPR 7, MERV 11 HDX-A201-11-6",
      "description": "Indoor air quality is commonly affected by particles such as dust, pet dander, and viruses. HDX is dedicated to providing a clean and comfortable indoor environment for everyone. We have a complete ar",
      "brand": "HDX",
      "price": 31.98,
      "predicted_cluster": "lighting",
      "true_product_type": "hvac_air_filter",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 8,
      "index": 95,
      "title": "Leviton 15 Amp Smartlock Pro Self-Test GFCI Combination 24-Watt (4.8 Amp) Type A USB In-Wall Charger Duplex Outlet, White R02-GUSB1-0BW",
      "description": "The SmartlockPro Self-Test GFCI Combination Type A USB In-Wall Charger offers the trusted safety of Leviton GFCI protection with the advantage of powerful USB charging for Code-compliant use in kitche",
      "brand": "Leviton",
      "price": 42.1,
      "predicted_cluster": "lighting",
      "true_product_type": "gfci_usb_outlet",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 9,
      "index": 324,
      "title": "Lithonia Lighting GTL 24 in. x 48 in. 128-Watt Equivalent Integrated LED White Troffer Light 4000K 2GTL 4 70LHE GZ10 PWS1836 LP840",
      "description": "The 4 ft. L LED Troffer from Lithonia Lighting delivers general ambient lighting in applications such as schools, offices and hospitals. Long-life LEDs, coupled with energy efficient drivers, provide ",
      "brand": "Lithonia Lighting",
      "price": 79.99,
      "predicted_cluster": "lighting",
      "true_product_type": "led_troffer_light",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 10,
      "index": 34,
      "title": "Andersen 27-1/2 in. x 35-1/2 in. 200-Series White Double-Hung Clad Wood Window with White Interior Low-E Glass and White Hardware 9163982",
      "description": "The Andersen 200-Series Double Hung Wood Window features a durable pine construction with an attractive, low-maintenance exterior. Low-E4 insulated glass is energy efficient and helps reduce your ener",
      "brand": "Andersen",
      "price": 259.0,
      "predicted_cluster": "lighting",
      "true_product_type": "double_hung_window",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 11,
      "index": 30,
      "title": "Malco 18 in. Folding Tool, Folding Depths of 3/8 in. and 1 in. 18F",
      "description": "Folding Tool seams are formed from 2-steel halves, permanently joined together. Handy sight holes assure proper depth alignment. 18 in. (46 cm) Folding Tool with 3/8 in. (9.5 mm) and 1 in. (25.4 mm) d",
      "brand": "Malco",
      "price": 23.27,
      "predicted_cluster": "lighting",
      "true_product_type": "metal_folding_tool",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 12,
      "index": 107,
      "title": "StyleWell 6 in. x 8 in. Satin Nickel Steel Classic Arch Decorative Shelf Bracket 27790SNLHD",
      "description": "These StyleWell easy-to -install decorative brackets are good for wood shelving storage while enhancing your interior decor. The satin nickel classic arch design is great for use in residential and co",
      "brand": "StyleWell",
      "price": 8.98,
      "predicted_cluster": "lighting",
      "true_product_type": "decorative_shelf_bracket",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 13,
      "index": 186,
      "title": "Commercial Electric 11 in. White Integrated LED Dimmable Flush Mount Puff with Adjustable CCT and RGB at 1400 Lumens Powered by Hubspace CD44bRGBW11W",
      "description": "The 11 in. Commercial Electric Smart Integrated LED Flush Mount is a great addition to any room. This light can be controlled through the Hubspace app (no hub required) on your smart devices or throug",
      "brand": "Commercial Electric",
      "price": 31.85,
      "predicted_cluster": "lighting",
      "true_product_type": "smart_flush_mount_light",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 14,
      "index": 195,
      "title": "Hampton Bay 75-Watt Equivalent Low Voltage Black LED Outdoor Landscape Flood Light Powered by Hubspace L08157",
      "description": "This Low Voltage smart light offers color adjustable Integrated LED lighting. Sturdy, aluminum waterproof construction allows light to withstand any weather. Simply plug-in and connect this waterproof",
      "brand": "Hampton Bay",
      "price": 59.17,
      "predicted_cluster": "lighting",
      "true_product_type": "landscape_flood_light",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 15,
      "index": 418,
      "title": "Milwaukee Red Disposable Earplugs (10-Pack) with 32 dB Noise Reduction Rating 48-73-3001",
      "description": "The Milwaukee Ear Plugs are designed to provide users with all day comfort while working on the jobsite. The soft comfortable foam expands quickly in the user's ear for a secure seal to protect agains",
      "brand": "Milwaukee",
      "price": 4.47,
      "predicted_cluster": "lighting",
      "true_product_type": "disposable_earplugs",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 16,
      "index": 26,
      "title": "Werner 5 in 1 Multi Position Pro 14 ft. Reach Aluminum Adjustable Multi Position Ladder, 375 lb. Load Capacity Type IAA Duty MT-14IAA",
      "description": "Access hard-to-reach places with this Werner 14-ft. reach 5-in-1 multi-position pro ladder. It features 16 adjustable working heights and an adjustable telescoping design for convenient placement. To ",
      "brand": "Werner",
      "price": 179.0,
      "predicted_cluster": "lighting",
      "true_product_type": "multi_position_ladder",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 17,
      "index": 176,
      "title": "Home Decorators Collection Closmere 5 in. 1-Light Brushed Gold Mid-Century Modern Wall Sconce with Clear Glass Shade HB3696-338",
      "description": "The Closmere family of light fixtures adds a mid-century modern touch to your interior decor. With its luxurious brushed gold finish and clear glass shade, the Closmere wall sconce is sure to be a con",
      "brand": "Home Decorators Collection",
      "price": 59.97,
      "predicted_cluster": "lighting",
      "true_product_type": "wall_sconce",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 18,
      "index": 322,
      "title": "Milwaukee X-Large Black Nitrile Level 1 Cut Resistant Dipped Work Gloves 48-73-8903",
      "description": "Out Cut Level 1 Nitrile Dipped Gloves are designed to provide ultimate durability, all-day comfort, and best in class dexterity for handling small objects. SMARTSWIPE index fingertips provide full acc",
      "brand": "Milwaukee",
      "price": 4.88,
      "predicted_cluster": "lighting",
      "true_product_type": "work_gloves",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 19,
      "index": 41,
      "title": "GE PowerMark Gold 200 Amp 10 in. Enclosed Outdoor Circuit Breaker THQMV200NRE",
      "description": "The GE PowerMark Gold 200 Amp 10 in. Enclosed Outdoor Circuit Breaker has been factory installed into its enclosure, comes with its own mounting base and is approved for outdoor use. The circuit break",
      "brand": "GE",
      "price": 189.0,
      "predicted_cluster": "electrical",
      "true_product_type": "circuit_breaker",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 20,
      "index": 75,
      "title": "Square D Homeline 70 Amp 2-Space 4-Circuit Outdoor Main Lug Load Center(HOM24L70RBCP) HOM24L70RBCP",
      "description": "The Square D Homeline 70 Amp 2-Space 4-Circuit Outdoor Main Lugs Load Center is UL listed for residential and commercial power distribution. This load center is built with a plated, aluminum bus bar t",
      "brand": "Square D",
      "price": 38.8,
      "predicted_cluster": "electrical",
      "true_product_type": "electrical_load_center",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 21,
      "index": 130,
      "title": "Airthings Wave Radon Battery Operated Smart Radon Detector 2951",
      "description": "Get smart about monitoring your radon. Radon is the number one cause of lung cancer among non-smokers and kills more than 6x the number of people than home fires and carbon monoxide poisoning combined",
      "brand": "Airthings",
      "price": 139.9,
      "predicted_cluster": "electrical",
      "true_product_type": "radon_detector",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 22,
      "index": 234,
      "title": "Coolaroo Oatmeal Cordless Light Filtering Fade Resistant Fabric Exterior Roller Shade 96 in. W x 72 in. L 458379",
      "description": "Coolaroo Spring Operated 80% UV Protection Outdoor Roller Shades feature our unique high density polyethylene (HDPE) knitted fabric that provides sun protection, cooling capabilities and weather resis",
      "brand": "Coolaroo",
      "price": 92.98,
      "predicted_cluster": "locks",
      "true_product_type": "outdoor_roller_shade",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 23,
      "index": 2,
      "title": "Kwikset HALO Satin Nickel Keypad WiFi Electronic Single-Cylinder Smart Lock Deadbolt featuring SmartKey Security 938WIFIKYPD15SM",
      "description": "HALO Wi-Fi Smart Lock is a keyless entry electronic deadbolt featuring SmartKey Security that allows you to control the lock from anywhere there's an internet connection--no smart hub or bridge requir",
      "brand": "Kwikset",
      "price": 169.39,
      "predicted_cluster": "locks",
      "true_product_type": "smart_deadbolt_lock",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 24,
      "index": 116,
      "title": "Pfister 971-250 2-3/4 in. Replacement Valve Stem Assembly for 08 Series Tub and Shower Single-Handle Faucets 864540",
      "description": "Pfister OEM (original equipment manufacture) 971-250 valve stem assembly. Used to replace worn or damaged assemblies in 08 series Pfister tub/shower faucets. Durable plastic construction for years of ",
      "brand": "Pfister",
      "price": 29.08,
      "predicted_cluster": "plumbing",
      "true_product_type": "faucet_valve_stem",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 25,
      "index": 423,
      "title": "Watts 1 in. Bronze Double Check Valve Backflow Preventer Assembly Quarter Turn Shutoff With Single Top Entry Freeze Sensor 007M1-QT-FZ 1 R",
      "description": "This 1 in. double check valve backflow preventer assembly is designed to prevent the backflow of polluted water from entering into the potable water supply due to backsiphonage and or backpressure in ",
      "brand": "Watts",
      "price": 358.52,
      "predicted_cluster": "plumbing",
      "true_product_type": "backflow_preventer_valve",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 26,
      "index": 305,
      "title": "Anvil Replacement Blade THD-blade-set",
      "description": "This HDX roofing stripper replacement blade can fit 27 in. and 47 in. roofing shovels. It features a skid plate, face plate, and all needed bolts, nuts and washers. The blade is heat treated and galva",
      "brand": "Anvil",
      "price": 10.92,
      "predicted_cluster": "hardware",
      "true_product_type": "roofing_shovel_blade",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 27,
      "index": 164,
      "title": "TrimMaster Satin Nickel 5.5mm x 74 in. Aluminum Stair Nosing Floor Transition Strip HLVT7SN74",
      "description": "Master your residential or commercial flooring project with TrimMaster Metal LVT Transition Strips. Manufactured of premium powder coating aluminum, this floor edging trim and border features a profes",
      "brand": "TrimMaster",
      "price": 25.99,
      "predicted_cluster": "hardware",
      "true_product_type": "stair_nosing_trim",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 28,
      "index": 119,
      "title": "Home Decorators Collection 72 in. - 144 in. Telescoping 1 in. Double Curtain Rod in Brushed Nickel with Crystal Square Finials U-BN144FOMS03",
      "description": "Add style to your home with this Double Curtain Rod from the Home Decorators Collection. This contemporary rod features crystal finials and a brushed nickel finish that will match your decor perfectly",
      "brand": "Home Decorators Collection",
      "price": 78.77,
      "predicted_cluster": "tools",
      "true_product_type": "double_curtain_rod",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 29,
      "index": 88,
      "title": "DIABLO 3/4 in. x 12 in. SDS-Plus Rebar Cutter DMAPLRC1050",
      "description": "Diablo's SDS-Plus rebar cutters provide one of the most durable drilling solutions on the market for rebar cutting. A unique brazing and hardening process of the carbide tips extends life and producti",
      "brand": "DIABLO",
      "price": 35.21,
      "predicted_cluster": "tools",
      "true_product_type": "sds_plus_rebar_cutter",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 30,
      "index": 36,
      "title": "Leviton 15 Amp Decora Combination Tamper Resistant Duplex Outlet and USB Charger, White (3-Pack) T5632-3BW M02-T5632-3BW",
      "description": "Our USB Charger Devices feature a smart chip that recognizes and optimizes the charging power of your electronic devices for fast and efficient charging. Strategically placed vertical USB Ports in all",
      "brand": "Leviton",
      "price": 53.25,
      "predicted_cluster": "smart_home",
      "true_product_type": "usb_outlet",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 31,
      "index": 96,
      "title": "Leviton 3.6A USB Dual Type A In-Wall Charger with 15 Amp Tamper-Resistant Outlets, Black T5632-BE R05-T5632-0BE",
      "description": "Our USB Charger Devices feature a smart chip that recognizes and optimizes the charging power of your electronic devices for fast and efficient charging. Strategically placed vertical USB ports in all",
      "brand": "Leviton",
      "price": 17.89,
      "predicted_cluster": "smart_home",
      "true_product_type": "usb_outlet",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 32,
      "index": 90,
      "title": "TITAN EP 60X Fine Finishing HVLP Paint Sprayer 2456369",
      "description": "The Titan EP 60X fine finishing HVLP paint sprayer is designed for professional and enthusiast woodworkers who want to provide a smooth, superior finish on their projects or jobs. The professional Pre",
      "brand": "TITAN",
      "price": 349.99,
      "predicted_cluster": "paint",
      "true_product_type": "hvlp_paint_sprayer",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 33,
      "index": 339,
      "title": "Glacier Bay Dolancourt Tight Radius 33 in. Drop-In Single Bowl 18 Gauge Stainless Steel Kitchen Sink with Pull-Down Faucet VDR3322A1PA1",
      "description": "Enhance your kitchen interior with this Glacier Bay all-in-1-dual mount single bowl kitchen sink. It comes with a pull-down sprayer head, a bottom grid, a drain, a strainer, and a soap dispenser. You ",
      "brand": "Glacier Bay",
      "price": 389.0,
      "predicted_cluster": "paint",
      "true_product_type": "kitchen_sink_with_faucet",
      "difficulty": "medium",
      "notes": ""
    },
    {
      "sample_id": 34,
      "index": 358,
      "title": "",
      "description": "",
      "brand": "",
      "price": 0.0,
      "predicted_cluster": "uncategorized",
      "true_product_type": "missing_data",
      "difficulty": "hard",
      "notes": "Edge case: uncategorized"
    },
    {
      "sample_id": 35,
      "index": 375,
      "title": "",
      "description": "",
      "brand": "",
      "price": 0.0,
      "predicted_cluster": "uncategorized",
      "true_product_type": "missing_data",
      "difficulty": "hard",
      "notes": "Edge case: short_title"
    },
    {
      "sample_id": 36,
      "index": 411,
      "title": "",
      "description": "",
      "brand": "",
      "price": 0.0,
      "predicted_cluster": "uncategorized",
      "true_product_type": "missing_data",
      "difficulty": "hard",
      "notes": "Edge case: missing_description"
    },
    {
      "sample_id": 37,
      "index": 409,
      "title": "HDX Disposable Earplugs (50-Pack) REP501 50PK",
      "description": "Soft and easy to roll for positive insertion and removal. Disposable, soft polyurethane foam, 100% PVC free. Contoured, high-rebound foam for a more secure fit. Sound absorption level: 32dB NRR.",
      "brand": "HDX",
      "price": 12.98,
      "predicted_cluster": "uncategorized",
      "true_product_type": "disposable_earplugs",
      "difficulty": "hard",
      "notes": "Edge case: uncategorized"
    },
    {
      "sample_id": 38,
      "index": 375,
      "title": "",
      "description": "",
      "brand": "",
      "price": 0.0,
      "predicted_cluster": "uncategorized",
      "true_product_type": "missing_data",
      "difficulty": "hard",
      "notes": "Edge case: missing_description"
    },
    {
      "sample_id": 39,
      "index": 23,
      "title": "RYOBI Tune-Up Kit for 37cc and 38cc Gas Chainsaws AC0538CSK",
      "description": "Keep your chain saw running like new with this tune-up kit. This kit includes quality replacements for the parts most susceptible to wear and tear during use. Prepare yourself for the season ahead wit",
      "brand": "RYOBI",
      "price": 24.0,
      "predicted_cluster": "lighting",
      "true_product_type": "chainsaw_tuneup_kit",
      "difficulty": "easy",
      "notes": "Random sample"
    },
    {
      "sample_id": 40,
      "index": 406,
      "title": "Milwaukee SHOCKWAVE Impact Duty Alloy Steel Hex Screw Driver Bit Set (9-Piece) 48-32-4616",
      "description": "The MILWAUKEE® SHOCKWAVE™ Impact Duty Hex Driver Bits provide the Ultimate Fit for a superior driving experience. The optimized SHOCKZONE™ shanks are customized per tip type to absorb peak torque and ",
      "brand": "Milwaukee",
      "price": 10.97,
      "predicted_cluster": "tools",
      "true_product_type": "hex_driver_bits",
      "difficulty": "easy",
      "notes": "Random sample"
    },
    {
      "sample_id": 41,
      "index": 262,
      "title": "Delta Foundations 2-Piece 1.1 GPF/1.6 GPF Dual Flush Round Toilet in White C41913D-WH",
      "description": "Beautifully designed for easy installation, maximum flush and water savings, this Delta WaterSense labeled two-piece toilet offers everything you need. Delta Dual-Flush Toilets allow you to choose bet",
      "brand": "Delta",
      "price": 179.0,
      "predicted_cluster": "lighting",
      "true_product_type": "dual_flush_toilet",
      "difficulty": "easy",
      "notes": "Random sample"
    },
    {
      "sample_id": 42,
      "index": 301,
      "title": "Commercial Electric Bookshelf Speaker Wall Mounts, No Stud Required (Set of 2) MB-74230",
      "description": "Enhance your home audio setup with our sleek Bookshelf Speaker Wall Mounts. Designed for small to medium speakers weighing up to 30 lbs., these mounts offer a secure and unobtrusive way to display you",
      "brand": "Commercial Electric",
      "price": 10.14,
      "predicted_cluster": "lighting",
      "true_product_type": "speaker_wall_mounts",
      "difficulty": "easy",
      "notes": "Random sample"
    },
    {
      "sample_id": 43,
      "index": 70,
      "title": "Commercial Electric Slim Baffle Integrated LED 4 in Round Adj Color Temp Canless Recessed Light for Kitchen Bath Living rooms, White 4-Pack 91475",
      "description": "The Color Temperature Select Recessed Lighting Kits are the recessed lights of the future. Not only is each fixture is designed specifically for small spaces where height clearance is limited such as ",
      "brand": "Commercial Electric",
      "price": 102.58,
      "predicted_cluster": "lighting",
      "true_product_type": "recessed_light_fixture",
      "difficulty": "easy",
      "notes": "Random sample"
    },
    {
      "sample_id": 44,
      "index": 218,
      "title": "Feit Electric 6 ft. Plug-In White Strip Light Cuttable Linkable Integrated LED Color Changing CCT Onesync Under Cabinet Light (1-Pack) UCL72/FLEX/5CCT",
      "description": "Add sleek ambient lighting underneath your cabinets and toe kicks with OneSync Selectable White Undercabinet LED Tape from Feit Electric. This 6-foot strip with embedded LEDs plugs into the nearest ou",
      "brand": "Feit Electric",
      "price": 36.97,
      "predicted_cluster": "lighting",
      "true_product_type": "under_cabinet_light",
      "difficulty": "easy",
      "notes": "Random sample"
    },
    {
      "sample_id": 45,
      "index": 47,
      "title": "GE PowerMark Plus 125 Amp 8-Space 16-Circuit Indoor Main Lug Breaker Value Kit TLM812SCUD1K",
      "description": "This value kit includes 3 20 Amp Single-Pole THQP 1/2 in. Circuit Breakers. The load center includes a sturdy tin-plated copper buss bar and a galvanized box for increased durability and reliability. ",
      "brand": "GE",
      "price": 45.98,
      "predicted_cluster": "electrical",
      "true_product_type": "circuit_breaker_kit",
      "difficulty": "easy",
      "notes": "Random sample"
    },
    {
      "sample_id": 46,
      "index": 310,
      "title": "VELCRO 5 ft. x 3/4 in. Sticky Back Tape 90087",
      "description": "VELCRO Brand Sticky Back hook and loop fasteners deliver strong holding power. Simple peel and stick application. For smooth surfaces such as painted wallboard, glass, metal and most plastics, can be ",
      "brand": "VELCRO",
      "price": 6.76,
      "predicted_cluster": "lighting",
      "true_product_type": "velcro_fastener_tape",
      "difficulty": "easy",
      "notes": "Random sample"
    },
    {
      "sample_id": 47,
      "index": 170,
      "title": "Hampton Bay Pratford 2.6 ft. 4-Light Brushed Nickel Integrated LED Fixed Track Lighting Kit 23055-000",
      "description": "The 2.6 ft. 4-Light Brushed Nickel Integrated LED Track Lighting Kit is a sleek, elevated fixture. It's perfect for any space that needs additional light, whether that's the kitchen, the living room, ",
      "brand": "Hampton Bay",
      "price": 94.97,
      "predicted_cluster": "lighting",
      "true_product_type": "led_track_lighting_kit",
      "difficulty": "easy",
      "notes": "Random sample"
    },
    {
      "sample_id": 48,
      "index": 352,
      "title": "Home Decorators Collection Orbit 1-Light Black Mini Pendant with Black Metal Strap Design and Bulb Included HDP12107ORB",
      "description": "Rotating black metal straps showcase a 60-Watt vintage bulb on this eye catching 12 in. mini pendant. This design will complement a various number of styles and can be used throughout your home or bus",
      "brand": "Home Decorators Collection",
      "price": 84.97,
      "predicted_cluster": "lighting",
      "true_product_type": "mini_pendant_light",
      "difficulty": "easy",
      "notes": "Random sample"
    }
  ]
}